morbos/ada/svd2ada/CMSIS-SVD/ST/STM32L5x2.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOH">
      <name>SEC_GPIOH</name>
      <baseAddress>0x52021C00</baseAddress>
    </peripheral>
    <peripheral>
      <name>TAMP</name>
      <description>Tamper and backup registers</description>
      <groupName>TAMP</groupName>
      <baseAddress>0x50003400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFF0000</resetValue>
          <fields>
            <field>
              <name>TAMP1E</name>
              <description>TAMP1E</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMP2E</name>
              <description>TAMP2E</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMP3E</name>
              <description>TAMP3E</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP4E</name>
              <description>TAMP4E</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP5E</name>
              <description>TAMP5E</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP6E</name>
              <description>TAMP6E</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP7E</name>
              <description>TAMP7E</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP8E</name>
              <description>TAMP8E</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>ITAMP1E</name>
              <description>ITAMP1E</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>ITAMP2E</name>
              <description>ITAMP2E</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITAMP3E</name>
              <description>ITAMP3E</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITAMP5E</name>
              <description>ITAMP5E</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITAMP8E</name>
              <description>ITAMP5E</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TAMP1NOER</name>
              <description>TAMP1NOER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMP2NOER</name>
              <description>TAMP2NOER</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP3NOER</name>
              <description>TAMP3NOER</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP4NOER</name>
              <description>TAMP4NOER</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP5NOER</name>
              <description>TAMP5NOER</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP6NOER</name>
              <description>TAMP6NOER</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP7NOER</name>
              <description>TAMP7NOER</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP8NOER</name>
              <description>TAMP8NOER</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMP1MSK</name>
              <description>TAMP1MSK</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMP2MSK</name>
              <description>TAMP2MSK</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP3MSK</name>
              <description>TAMP3MSK</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>BKERASE</name>
              <description>BKERASE</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMP1TRG</name>
              <description>TAMP1TRG</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMP2TRG</name>
              <description>TAMP2TRG</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP3TRG</name>
              <description>TAMP3TRG</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP4TRG</name>
              <description>TAMP4TRG</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP5TRG</name>
              <description>TAMP5TRG</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP6TRG</name>
              <description>TAMP6TRG</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP7TRG</name>
              <description>TAMP7TRG</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP8TRG</name>
              <description>TAMP8TRG</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>CR3</name>
          <displayName>CR3</displayName>
          <description>control register 3</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ITAMP1NOER</name>
              <description>ITAMP1NOER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITAMP2NOER</name>
              <description>ITAMP2NOER</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>ITAMP3NOER</name>
              <description>ITAMP3NOER</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>ITAMP5NOER</name>
              <description>ITAMP5NOER</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>ITAMP8NOER</name>
              <description>ITAMP8NOER</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLTCR</name>
          <displayName>FLTCR</displayName>
          <description>TAMP filter control register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TAMPFREQ</name>
              <description>TAMPFREQ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TAMPFLT</name>
              <description>TAMPFLT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TAMPPRCH</name>
              <description>TAMPPRCH</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TAMPPUDIS</name>
              <description>TAMPPUDIS</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ATCR1</name>
          <displayName>ATCR1</displayName>
          <description>TAMP active tamper control register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00070000</resetValue>
          <fields>
            <field>
              <name>TAMP1AM</name>
              <description>TAMP1AM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMP2AM</name>
              <description>TAMP2AM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMP3AM</name>
              <description>TAMP3AM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP4AM</name>
              <description>TAMP4AM</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP5AM</name>
              <description>TAMP5AM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP6AM</name>
              <description>TAMP6AM</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP7AM</name>
              <description>TAMP7AM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP8AM</name>
              <description>TAMP8AM</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATOSEL1</name>
              <description>ATOSEL1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
			<field>
              <name>ATOSEL2</name>
              <description>ATOSEL2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
			<field>
              <name>ATOSEL3</name>
              <description>ATOSEL3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
			<field>
              <name>ATOSEL4</name>
              <description>ATOSEL4</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
			<field>
              <name>ATCKSEL</name>
              <description>ATCKSEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
			<field>
              <name>ATPER</name>
              <description>ATPER</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
			<field>
              <name>ATOSHARE</name>
              <description>ATOSHARE</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>FLTEN</name>
              <description>FLTEN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ATSEEDR</name>
          <displayName>ATSEEDR</displayName>
          <description>TAMP active tamper seed register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEED</name>
              <description>Pseudo-random generator seed value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ATOR</name>
          <displayName>ATOR</displayName>
          <description>TAMP active tamper output register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRNG</name>
              <description>Pseudo-random generator value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
			<field>
              <name>SEEDF</name>
              <description>Seed running flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>INITS</name>
              <description>Active tamper initialization status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ATCR2</name>
          <displayName>ATCR2</displayName>
          <description>TAMP active tamper control register 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ATOSEL1</name>
              <description>ATOSEL1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
			<field>
              <name>ATOSEL2</name>
              <description>ATOSEL2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
			<field>
              <name>ATOSEL3</name>
              <description>ATOSEL3</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
			<field>
              <name>ATOSEL4</name>
              <description>ATOSEL4</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
			<field>
              <name>ATOSEL5</name>
              <description>ATOSEL5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
			<field>
              <name>ATOSEL6</name>
              <description>ATOSEL6</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
			<field>
              <name>ATOSEL7</name>
              <description>ATOSEL7</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
			<field>
              <name>ATOSEL8</name>
              <description>ATOSEL8</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCR</name>
          <displayName>SMCR</displayName>
          <description>TAMP secure mode register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKPRWDPROT</name>
              <description>Backup registers read/write protection offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
			<field>
              <name>BKPWDPROT</name>
              <description>Backup registers write protection offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
			<field>
              <name>TAMPDPROT</name>
              <description>Tamper protection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCR</name>
          <displayName>PRIVCR</displayName>
          <description>TAMP privilege mode control register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKPRWPRIV</name>
              <description>Backup registers zone 1 privilege protection</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>BKPWPRIV</name>
              <description>Backup registers zone 2 privilege protection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMPPRIV</name>
              <description>Tamper privilege protection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>TAMP interrupt enable register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TAMP1IE</name>
              <description>TAMP1IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMP2IE</name>
              <description>TAMP2IE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP3IE</name>
              <description>TAMP3IE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP4IE</name>
              <description>TAMP4IE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP5IE</name>
              <description>TAMP5IE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP6IE</name>
              <description>TAMP6IE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP7IE</name>
              <description>TAMP7IE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>TAMP8IE</name>
              <description>TAMP8IE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITAMP1IE</name>
              <description>ITAMP1IE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>ITAMP2IE</name>
              <description>ITAMP2IE</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITAMP3IE</name>
              <description>ITAMP3IE</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITAMP5IE</name>
              <description>ITAMP5IE</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITAMP8IE</name>
              <description>ITAMP8IE</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
